{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "cf6c6ed8-5bc9-43b8-ac17-525189aeb9f2",
   "metadata": {},
   "source": [
    "Задание\n",
    "Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "​\n",
    "Исходные данные имеют следующую структуру:\n",
    "​\n",
    "1. перечень всех документов\n",
    "​\n",
    "documents = [\n",
    "{‘type’: ‘passport’, ‘number’: ‘2207 876234’, ‘name’: ‘Василий Гупкин’},\n",
    "{‘type’: ‘invoice’, ‘number’: ‘11-2’, ‘name’: ‘Геннадий Покемонов’},\n",
    "{‘type’: ‘insurance’, ‘number’: ‘10006’, ‘name’: ‘Аристарх Павлов’}\n",
    "]\n",
    "​\n",
    "2. перечень полок, на которых хранятся документы (если документ есть в documents, он обязательно должен быть и в directories)\n",
    "​\n",
    "directories = {\n",
    "‘1’: [‘2207 876234’, ‘11-2’],\n",
    "‘2’: [‘10006’],\n",
    "‘3’: []\n",
    "}\n",
    "​\n",
    "Общие требования к программе:\n",
    "​\n",
    "\n",
    "код должен быть грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции переиспользуются, а их код не повторяется;\n",
    "в коде отсутствуют глобальные переменные, за исключением documents и directories;\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу вводом команды q.\n",
    "Задача 1\n",
    "Пользователь по команде p может узнать владельца документа по его номеру.\n",
    "\n",
    "Пример работы программы:\n",
    "​\n",
    "Введите команду:\n",
    "p\n",
    "​\n",
    "Введите номер документа:\n",
    "10006\n",
    "​\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов\n",
    "\n",
    "Задача 2 (необязательная)\n",
    "Секретарь по команде s может по номеру документа узнать, на какой полке документ хранится.\n",
    "\n",
    "Пример работы программы:\n",
    "Введите команду:\n",
    "s\n",
    "​\n",
    "Введите номер документа:\n",
    "10006\n",
    "​\n",
    "Результат:\n",
    "Документ хранится на полке: 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d849e274-0fee-41ab-8aa6-3314c6c67db8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите команду (p - поиск владельца, s - поиск полки, q - выход):  p\n"
     ]
    }
   ],
   "source": [
    "def find_owner_by_document_number(documents, number):\n",
    "    for doc in documents:\n",
    "        if doc['number'] == number:\n",
    "            return doc['name']\n",
    "    return None\n",
    "\n",
    "def find_shelf_by_document_number(directories, number):\n",
    "    for shelf, docs in directories.items():\n",
    "        if number in docs:\n",
    "            return shelf\n",
    "    return None\n",
    "\n",
    "def main():\n",
    "    documents = [\n",
    "        {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "        {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "        {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "    ]\n",
    "\n",
    "    directories = {\n",
    "        '1': ['2207 876234', '11-2'],\n",
    "        '2': ['10006'],\n",
    "        '3': []\n",
    "    }\n",
    "\n",
    "    while True:\n",
    "        command = input(\"Введите команду (p - поиск владельца, s - поиск полки, q - выход): \").lower()\n",
    "\n",
    "        if command == 'q':\n",
    "            print(\"Программа завершена.\")\n",
    "            break\n",
    "\n",
    "        if command == 'p':\n",
    "            number = input(\"Введите номер документа: \")\n",
    "            owner = find_owner_by_document_number(documents, number)\n",
    "            if owner:\n",
    "                print(f\"Владелец документа: {owner}\")\n",
    "            else:\n",
    "                print(\"Документ не найден.\")\n",
    "\n",
    "        elif command == 's':\n",
    "            number = input(\"Введите номер документа: \")\n",
    "            shelf = find_shelf_by_document_number(directories, number)\n",
    "            if shelf:\n",
    "                print(f\"Документ хранится на полке: {shelf}\")\n",
    "            else:\n",
    "                print(\"Документ не найден.\")\n",
    "\n",
    "        else:\n",
    "            print(\"Некорректная команда. Пожалуйста, введите p, s или q.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5678892e-9987-44de-9145-d96fd8a0a42a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
