{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ed28c46d-95e7-40b9-8b85-ca0eb1c0fdde",
   "metadata": {},
   "source": [
    "Задание 1\n",
    "Напишите код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Дана переменная, в которой хранится четырёхзначное число — год. Необходимо написать программу, которая выведет, является этот год високосным или обычным.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "year = 2024\n",
    "Результат:\n",
    "Високосный год\n",
    "\n",
    "year = 2023\n",
    "Результат:\n",
    "Обычный год\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f88f798e-3ca3-4d5c-8aa5-c645775e7f5b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите год:  2016\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Високосный год\n"
     ]
    }
   ],
   "source": [
    "year = int(input(\"Введите год: \"))\n",
    "\n",
    "# Проверяем, является ли год високосным\n",
    "if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):\n",
    "    print(\"Високосный год\")\n",
    "else:\n",
    "    print(\"Обычный год\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "28ea39d5-5969-4457-bd8e-8b312d00a217",
   "metadata": {},
   "source": [
    "Задание 2 (необязательное)\n",
    "Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Дана переменная, в которой хранится шестизначное число — номер проездного билета. Напишите программу, которая будет определять, является ли этот билет счастливым. Билет считается счастливым, если сумма первых трёх цифр совпадает с суммой последних трёх цифр номера.\n",
    "\n",
    "Примеры работы программы:\n",
    "\n",
    "number = 123456\n",
    "Результат:\n",
    "Несчастливый билет\n",
    "\n",
    "number = 123321\n",
    "Результат:\n",
    "Счастливый билет"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "70b16d5b-d903-4c77-be14-0673565a8e81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Номер билета:  789699\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Счастливый билет\n"
     ]
    }
   ],
   "source": [
    "ticket_number = input(\"Номер билета: \")\n",
    "\n",
    "if len(ticket_number) != 6:\n",
    "    print(\"Введите шестизначный номер билета\")\n",
    "else:\n",
    "    int_ticket_number = int(ticket_number)\n",
    "    first_sum = 0\n",
    "    second_sum = 0\n",
    "    counter = 0\n",
    "    while int_ticket_number != 0:\n",
    "        digit = int_ticket_number % 10\n",
    "        int_ticket_number = int_ticket_number // 10\n",
    "        if counter < 3:\n",
    "            first_sum = first_sum + digit\n",
    "        else: \n",
    "            second_sum = second_sum + digit\n",
    "\n",
    "        counter = counter + 1\n",
    "        \n",
    "    if first_sum == second_sum:\n",
    "        print(\"Счастливый билет\")\n",
    "    else: \n",
    "        print(\"Несчастливый билет\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fbc011e6-6967-464b-b391-42f35a70b444",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
